{
    "header": {
        "name": {
            "part_1": "Mónus",
            "part_2": "Tamás"
        },
        "phone": {
            "label": "Telefon"
        },
        "email": {
            "label": "Email"
        }
    },
    "infos": {
        "summary": {
            "title": "Összegzés",
            "description": "Szeretek komplex és kreatív feladatokat megoldani a szoftverfejlesztés bármely területén, mind Front End mind Back End oldalon. Munkám során a legjobb megoldást kutatom egy-egy feladatra, amellyel a tökéletes megoldást kívánom nyújtani a megrendelőnek, miközben szakmailag is a legjobb megoldásra törekszem. Magas szintű tapasztalattal rendelkezem reszponzív felhasználói felületek elkészítésében, illetve Webes API fejlesztésében is. Ezen kívül tapasztalatot szereztem REST, SOA és FireBase alapú szerverek készítésében is."
        },
        "fun-fact": {
            "title": "Érdekes tény",
            "description": "Onnan tudni, hogy koncentrálok, hogy egy füllhallgatóval a fejemen csupán skype-on keresztül vagyok elérhető a mellettem ülő ember számára."
        },
        "experiences": {
            "title": "Tapasztalatok",
            "griff": {
                "title": "Senior Web fejlesztő | 2019 Szeptember - Jelenleg",
                "description": "Senior fejlesztőként több projekten is részt vettem, mint Angular és Web szakértő. Az újonnan induló zöld mezős projektek tervezésében és elindításában való részvételem mellett egy korábbi angularJS-ben készült alkalmazás teljesítménybeli problémáit is meg kellett vizsgálnom, majd javítanom is. Jelenleg pedig a cég fő termékének, illetve alapvető infrastruktúrájának modernizálását lehetővé tévő architektúra megteremtése a feladatom, ide értve egy belső, céges keretrendszer megalkotását is."
            },
            "nitro": {
                "title": "Web Fejlesztő | 2019 Február - 2019 Szeptember (0.5 év)",
                "description": "Egy 5 fős csapatot erősítve készítettünk el több Angularos webalkalmazást, mely során a Back End fejlesztőivel szorosan együttműködtünk, alkalmanként pedig Front End vezérelte módon is dolgoztunk. A projektek során ismét szükség volt automata tesztek írására unit és End-To-End tesztek formájában is."
            },
            "cas-angular": {
                "title": "Web Fejlesztő | 2016 Április - 2019 Február (3 év)",
                "description": "A csapatunk kutatta a cégen belül az Angular és egyéb Webes technológiák lehetőségeit, mint egy egyedi Cross Platform framework és API lehetséges alapját. Kutatásunk során mélységeiben megismerkedtem az Angular platformmal és lehetőségeivel. Valamint munkánk eredményeképpen elkészítettük az API első verzióját, mely publikálásra is került egy belső NPM repository keretein belül. Az API elkészítése során elsajátítottam az End-To-End tesztelés alapjait, melyet a projekt során használnom is kellett."
            },
            "cas-NET": {
                "title": ".NET Fejlesztő | 2014 Április - 2016 Április (2 év)",
                "description": "Msc egyetemi tanulmányaim mellett kezdtem el dolgozni, kezdetben, mint diák munkatárs, C# nyelven. Ennek során több különböző .NET technológiát megismertem, kezdetben ASP.NET webes alkalmazást fejlesztettem egy nagyobb csapat tagjaként SCRUM metodológiát követve. Majd egy másik csapat tagjaként elsajátítottam a Windows 8.1 fejlesztés alapjait, később pedig részt vettem egy Cross Platform keretrendszer előfejlesztési munkálataiban WPF, illetve UWP technológiákkal."
            }
        }
    },
    "profile": {
        "birthday": {
            "year": "1991",
            "month": "04",
            "day": "15"
        },
        "profession": {
            "software": "Szoftver",
            "engineer": "Fejlesztő"
        }
    }
}
